src/cf/Catalogs/ТрудовыеФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТрудовыеФункции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПрофессиональнойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКЗ2026</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ТрудовыеФункции/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ"));
	Иначе
		
		Если ОбщегоНазначения.РабочаяДатаПользователя() < ЭлектронныеТрудовыеКнижкиКлиентСервер.ДатаВсутпленияВСилуОКПДТР2026() Тогда
			ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ2026"));
		Иначе
			ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодПрофессиональнойДеятельности) Тогда
			Если СтрДлина(СокрЛП(КодПрофессиональнойДеятельности)) < 10 Тогда 
				ОбщегоНазначения.СообщитьПользователю(
					Нстр("ru = 'Неверно заполнен Код профессиональной деятельности - недостаточно символов.'"), 
					ЭтотОбъект, "КодПрофессиональнойДеятельности", , Отказ);
			ИначеЕсли Не ЗначениеЗаполнено(Сред(КодПрофессиональнойДеятельности, 8, 1))
				Или (Не СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Сред(КодПрофессиональнойДеятельности, 8, 1))
				И Не СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(Сред(КодПрофессиональнойДеятельности, 8, 1))) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					Нстр("ru = 'Неверно заполнен Код профессиональной деятельности - восьмым символом должна быть буква.'"), 
					ЭтотОбъект, "КодПрофессиональнойДеятельности", , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
